
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 8 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.connection_string
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic
  * module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.Insights/components/hmc-aat"
        name                                  = "hmc-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.connection_string will be created
  + resource "azurerm_key_vault_secret" "connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat"
        name     = "hmc-shared-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat"
        name                                = "hmc-servicebus-aat"
      ~ tags                                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 1 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Premium" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = true -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 1 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Premium" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = true -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-from-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 1024 -> (known after apply)
        name                                    = "hmc-to-cft-aat"
      ~ requires_duplicate_detection            = false -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-subs-to-cft-aat" -> (known after apply)
        name                                      = "hmc-subs-to-cft-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.data.azurerm_resource_group.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "this"  {
      ~ id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat" -> (known after apply)
      ~ location   = "uksouth" -> (known after apply)
      + managed_by = (known after apply)
        name       = "hmc-shared-aat"
      ~ tags       = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#ccd-devops"
          - "application"         = "core-case-data"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ccd_support"
          - "environment"         = "staging"
          - "managedBy"           = "CDM"
        } -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 1 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Premium" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = true -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-cft-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat"
        name                            = "hmc-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/objectId/7df9d173-631b-47a6-8737-0f15616d25f0"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat|hmc-aat"
        name                       = "hmc-aat"
        # (2 unchanged attributes hidden)



      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmc-aat-mi"
        name                = "hmc-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 10 to add, 8 to change, 9 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_application_insights.appinsights has changed
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.Insights/components/hmc-aat"
        name                                  = "hmc-aat"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.api_gw_s2s_secret has changed
  ~ resource "azurerm_key_vault_secret" "api_gw_s2s_secret" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/api-gateway-s2s-secret/6d68905e36bd40fc951ab5a3371b9dc8"
        name                    = "api-gateway-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/api-gateway-s2s-secret/versions/6d68905e36bd40fc951ab5a3371b9dc8"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/api-gateway-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_key has changed
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/eafd2eb6721742c8af1c687b7c824af5"
        name                    = "AppInsightsInstrumentationKey"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/AppInsightsInstrumentationKey/versions/eafd2eb6721742c8af1c687b7c824af5"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/AppInsightsInstrumentationKey"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.hmc_cft_hearing_service_s2s_secret has changed
  ~ resource "azurerm_key_vault_secret" "hmc_cft_hearing_service_s2s_secret" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-cft-hearing-service-s2s-secret/2f974a64d76d4d768cd546699e014072"
        name                    = "hmc-cft-hearing-service-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-cft-hearing-service-s2s-secret/versions/2f974a64d76d4d768cd546699e014072"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-cft-hearing-service-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.hmc_hmi_inbound_adapter_s2s_secret has changed
  ~ resource "azurerm_key_vault_secret" "hmc_hmi_inbound_adapter_s2s_secret" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-hmi-inbound-adapter-s2s-secret/bde700aef52046a7ad403ef7b7eadb44"
        name                    = "hmc-hmi-inbound-adapter-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-hmi-inbound-adapter-s2s-secret/versions/bde700aef52046a7ad403ef7b7eadb44"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-hmi-inbound-adapter-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/cc5e7f4de4bd43678ca62364abc1127a"
        name                    = "hmc-servicebus-connection-string"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-servicebus-connection-string/versions/cc5e7f4de4bd43678ca62364abc1127a"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-servicebus-connection-string"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key has changed
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/aadc74b87d5f431baf328cdb247b3a45"
        name                    = "hmc-servicebus-shared-access-key"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-servicebus-shared-access-key/versions/aadc74b87d5f431baf328cdb247b3a45"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/secrets/hmc-servicebus-shared-access-key"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg has changed
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat"
        name     = "hmc-shared-aat"
        tags     = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (1 unchanged attribute hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace has changed
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + endpoint                            = "https://hmc-servicebus-aat.servicebus.windows.net:443/"
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat"
      + minimum_tls_version                 = "1.0"
        name                                = "hmc-servicebus-aat"
      + public_network_access_enabled       = true
        tags                                = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription has changed
  ~ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + client_scoped_subscription_enabled        = false
        id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-subs-to-cft-aat"
        name                                      = "hmc-subs-to-cft-aat"
        # (10 unchanged attributes hidden)
    }

  # module.vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (5 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                    "List",
                    "ListIssuers",
                    "SetIssuers",
                    "Update",
                    "ManageContacts",
                    "ManageIssuers",
                ]
                key_permissions         = [
                    "Create",
                    "List",
                    "Get",
                    "Delete",
                    "Update",
                    "Import",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Sign",
                    "Verify",
                ]
                object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
                secret_permissions      = [
                    "Set",
                    "List",
                    "Get",
                    "Delete",
                    "Recover",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + application_id          = ""
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "626041d7-1bf3-46ca-84b6-28b6b0c60efe"
              + secret_permissions      = [
                  + "List",
                  + "Get",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat"
        name                            = "hmc-aat"
      + public_network_access_enabled   = true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat|hmc-aat"
        name                       = "hmc-aat"
        # (2 unchanged attributes hidden)

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":24,"Program":"tfcmt","SHA1":"","Vars":{}} -->